
## :white_check_mark: Apply Result

[CI link](https://github.com/mizzy/sakura-cloud-education-touch-demo/actions/runs/1512301452)

<pre><code>Apply complete! Resources: 13 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
aws_vpc.ecs_sample: Refreshing state... [id=vpc-05fa6437d1950b505]
aws_s3_bucket.alb_log: Refreshing state... [id=alb-log-of-ecs-sample]
aws_subnet.public0: Refreshing state... [id=subnet-02d54a30d5f61210a]
aws_subnet.private0: Refreshing state... [id=subnet-0360de0228650800c]
aws_route_table.private0: Refreshing state... [id=rtb-04c52d0c2f4f6fb3e]
module.https_redirect_sg.aws_security_group.default: Refreshing state... [id=sg-0811d352871ab950e]
aws_subnet.public1: Refreshing state... [id=subnet-0e4d908c8b6012cf4]
aws_subnet.private1: Refreshing state... [id=subnet-0b80416f81081f9d5]
aws_route_table.private1: Refreshing state... [id=rtb-0eed5c91cda4b3acc]
aws_internet_gateway.igw: Refreshing state... [id=igw-0e1685b83df866267]
aws_route_table.public: Refreshing state... [id=rtb-02b3748a419fb2683]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-0d03c39c130171a25]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-0be58c4f1a48c6129]
aws_eip.ngw1: Refreshing state... [id=eipalloc-0db2eac64498abb7a]
aws_route.public: Refreshing state... [id=r-rtb-02b3748a419fb26831080289494]
aws_eip.ngw0: Refreshing state... [id=eipalloc-04e367929021a68b1]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0b0139d2ccca64f23]
module.https_redirect_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1723817718]
module.https_redirect_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2663386237]
aws_route_table_association.public0: Refreshing state... [id=rtbassoc-00ef7c2460170cd58]
aws_route_table_association.private0: Refreshing state... [id=rtbassoc-0104951db21990e4a]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-03c410620e7b366e5]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-701884444]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1132770594]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1740198367]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4215454654]
aws_nat_gateway.ngw1: Refreshing state... [id=nat-0a57b2a380445c52a]
aws_nat_gateway.ngw0: Refreshing state... [id=nat-07c363cea9ebe7c20]
aws_route.private1: Refreshing state... [id=r-rtb-0eed5c91cda4b3acc1080289494]
aws_route.private0: Refreshing state... [id=r-rtb-04c52d0c2f4f6fb3e1080289494]
aws_lb.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:loadbalancer/app/sample/2aef9e53f7888967]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=alb-log-of-ecs-sample]
aws_route53_record.sample: Refreshing state... [id=Z07054061YZ4SIOQH4B64_sakura-cloud-education-touch-demo.com_A]
aws_lb_target_group.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:targetgroup/sample/2ac5a7a4fd71cf94]
aws_acm_certificate.sample: Refreshing state... [id=arn:aws:acm:ap-northeast-1:722557045766:certificate/697fc502-eafd-4545-9c78-5a56899f47bd]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener/app/sample/2aef9e53f7888967/64f5cb61d316f892]
aws_route53_record.sample_cert_validation: Refreshing state... [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME]
aws_acm_certificate_validation.sample: Refreshing state... [id=2021-11-28 08:47:09 +0000 UTC]
aws_lb_listener_rule.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener-rule/app/sample/2aef9e53f7888967/64f5cb61d316f892/176d6d7af801e373]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lb_listener.https has been changed
  ~ resource "aws_lb_listener" "https" {
        id                = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener/app/sample/2aef9e53f7888967/64f5cb61d316f892"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_lb_listener_rule.sample has been changed
  ~ resource "aws_lb_listener_rule" "sample" {
        id           = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener-rule/app/sample/2aef9e53f7888967/64f5cb61d316f892/176d6d7af801e373"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.for_ecs will be created
  + resource "aws_cloudwatch_log_group" "for_ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/sample"
      + retention_in_days = 180
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.sample will be created
  + resource "aws_ecs_cluster" "sample" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "sample"
      + tags_all = (known after apply)

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.sample will be created
  + resource "aws_ecs_service" "sample" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "sample"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "sample"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:targetgroup/sample/2ac5a7a4fd71cf94"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0360de0228650800c",
              + "subnet-0b80416f81081f9d5",
            ]
        }
    }

  # aws_ecs_task_definition.sample will be created
  + resource "aws_ecs_task_definition" "sample" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "nginx:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/sample"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "nginx"
                        }
                    }
                  + name             = "sample"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "sample"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.ecs_task_execution_role.aws_iam_policy.default will be created
  + resource "aws_iam_policy" "default" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecs-task-execution"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.ecs_task_execution_role.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_task_execution_role.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-task-execution"
    }

  # module.ecs_task_role.aws_iam_policy.default will be created
  + resource "aws_iam_policy" "default" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecs-task"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.ecs_task_role.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs_task_role.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-task"
    }

  # module.nginx_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "nginx-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05fa6437d1950b505"
    }

  # module.nginx_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.nginx_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 13 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.for_ecs: Creating...
aws_ecs_cluster.sample: Creating...
module.ecs_task_role.aws_iam_role.default: Creating...
module.ecs_task_execution_role.aws_iam_policy.default: Creating...
module.ecs_task_execution_role.aws_iam_role.default: Creating...
module.nginx_sg.aws_security_group.default: Creating...
module.ecs_task_role.aws_iam_policy.default: Creating...
module.ecs_task_execution_role.aws_iam_policy.default: Creation complete after 1s [id=arn:aws:iam::722557045766:policy/ecs-task-execution]
module.ecs_task_role.aws_iam_policy.default: Creation complete after 1s [id=arn:aws:iam::722557045766:policy/ecs-task]
module.ecs_task_role.aws_iam_role.default: Creation complete after 1s [id=ecs-task]
module.ecs_task_role.aws_iam_role_policy_attachment.default: Creating...
module.ecs_task_execution_role.aws_iam_role.default: Creation complete after 1s [id=ecs-task-execution]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Creating...
aws_ecs_task_definition.sample: Creating...
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Creation complete after 1s [id=ecs-task-execution-20211128085513532900000002]
module.ecs_task_role.aws_iam_role_policy_attachment.default: Creation complete after 1s [id=ecs-task-20211128085513439500000001]
aws_ecs_task_definition.sample: Creation complete after 2s [id=sample]
aws_cloudwatch_log_group.for_ecs: Creation complete after 3s [id=/ecs/sample]
module.nginx_sg.aws_security_group.default: Creation complete after 5s [id=sg-0111abdb1dcf35f4c]
module.nginx_sg.aws_security_group_rule.egress: Creating...
module.nginx_sg.aws_security_group_rule.ingress: Creating...
module.nginx_sg.aws_security_group_rule.ingress: Creation complete after 2s [id=sgrule-1081637939]
module.nginx_sg.aws_security_group_rule.egress: Creation complete after 4s [id=sgrule-298557167]
aws_ecs_cluster.sample: Still creating... [10s elapsed]
aws_ecs_cluster.sample: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:722557045766:cluster/sample]
aws_ecs_service.sample: Creating...
aws_ecs_service.sample: Creation complete after 2s [id=arn:aws:ecs:ap-northeast-1:722557045766:service/sample/sample]

Apply complete! Resources: 13 added, 0 changed, 0 destroyed.

Outputs:

alb_dns_name = "sample-1357241970.ap-northeast-1.elb.amazonaws.com"
domain_name = "sakura-cloud-education-touch-demo.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"f49a1a5da234f7fd76497d2b010e9858eaa76128","Vars":{},"WorkflowName":"terraform"} -->